# How to
# install brew
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew tap homebrew/bundle
# touch ~/brewfile
# Install and update from brew bundle
# brew bundle --file=~/brewfile
# Export for existing install into Bundle
# brew bundle dump --file=~/brewfile --force
# brew bundle cleanup --force --file=~/brewfile
# brew outdated && brew upgrade --greedy --dry-run && mas outdated
# brew bundle --file=~/brewfile --force --verbose ; brew upgrade --greedy
# brew update : brew outdated ; brew upgrade --greedy --dry-run ; mas outdated ; brew bundle --file=~/brewfile --force ; brew upgrade --greedy
# in nushell
# brew update ; brew outdated ; brew upgrade --greedy --dry-run ; mas outdated  ; try { brew bundle --file=~/brewfile --force } catch { |err| print -e $err }; brew upgrade --greedy ; try { npm outdated -g --depth=0 } catch { |err| print -e $err }; npm update -g
# invlugin pip and uv
# brew update ; brew outdated ; brew upgrade --greedy --dry-run ; mas outdated  ; try { brew bundle --file=~/brewfile --force } catch { |err| print -e $err }; brew upgrade --greedy --force ; npm ls -g ; try { npm outdated -g --depth=0 } catch { |err| print -e $err }; npm update -g ; uv pip list ; uv pip list ; uv pip list --outdated ; uv tool list ; uv tool upgrade --all --no-cache
# install mapackage manually >  brew install --cask cursor-cli
# remove package mannually > brew uninstall --cask cursor-cli
# reinstal package manually > brew reinstall --cask cursor-cli

# Taps
tap "adoptopenjdk/openjdk"       # AdoptOpenJDK Java distributions
tap "sst/tap"                    # SST (Serverless Stack) framework
tap "nats-io/nats-tools"        # NATS messaging system tools
tap "netbirdio/tap"             # NetBird VPN/networking
tap "nikitabobko/tap"           # Aerospace tiling window manager
tap "runpod/runpodctl"          # RunPod GPU cloud CLI
tap "oven-sh/bun"               # Bun JavaScript runtime


# Brews
# brew "docker-compose"               # Multi-container Docker orchestration
# brew "kubectl"                       # Kubernetes cluster CLI
brew "age"                       # Modern file encryption tool (age-encryption.org)
brew "asciinema"                 # Terminal session recorder
brew "asdf"                      # Multi-language version manager
brew "asitop"                    # Apple Silicon performance monitor (CPU/GPU/ANE)
brew "atac"                      # TUI API client (like Postman in terminal)
brew "atuin"                     # Shell history sync and search with SQLite
brew "awscli"                    # AWS command-line interface
brew "bat"                       # Cat clone with syntax highlighting and git integration
brew "oven-sh/bun/bun"          # Fast JavaScript/TypeScript runtime and package manager
brew "btop"                      # Resource monitor (CPU, memory, disks, network)
brew "carapace"                  # Multi-shell completion engine
brew "code2prompt"               # Convert codebase to LLM prompts
brew "cmake"                     # Cross-platform build system generator
brew "crane"                     # Container registry image management tool
brew "curlie"                    # curl frontend with HTTPie-like syntax and output
brew "czkawka"                   # Duplicate file and broken symlink finder
brew "dust"                      # Intuitive disk usage viewer (du replacement)
brew "elixir-ls"                 # Elixir language server for LSP
brew "exiftool"                  # Read/write metadata in image/video/audio files
brew "eza"                       # Modern ls replacement with colors and icons
brew "fd"                        # Fast file finder (find replacement) # yazi dependency
brew "fdupes"                    # Duplicate file finder and remover
brew "ffmpegthumbnailer"         # Video thumbnail generator # yazi dependency
brew "fzf"                       # Fuzzy finder for files, history, and more # yazi dependency
brew "go"                        # Go programming language
brew "gh"                        # GitHub CLI (PRs, issues, repos from terminal)
brew "glow"                      # Markdown renderer for terminal
brew "helix"                     # Post-modern modal text editor (Rust-based)
brew "hexyl"                     # Colorized hex viewer for binary files
brew "htop"                      # Interactive process viewer (top replacement)
brew "huggingface-cli"               # Hugging Face model hub CLI
brew "imagemagick"               # Image manipulation toolkit # yazi dependency
brew "jj"                        # Jujutsu - Git-compatible VCS with simpler mental model
brew "jq"                        # Command-line JSON processor # yazi dependency
brew "kimi-cli"                  # Kimi AI assistant CLI
brew "llama.cpp"                 # Local LLM inference engine (GGUF models)
brew "lf"                        # Terminal file manager (Go-based)
brew "lima"                      # Linux virtual machines on macOS (for containers)
brew "llm"                       # CLI for interacting with LLMs (Simon Willison)
brew "lua-language-server"       # Lua LSP server (for Neovim config editing)
brew "mas"                       # Mac App Store CLI
# brew "nats-io/nats-tools/nats"       # NATS messaging system CLI
# brew "nats-server"                   # NATS lightweight messaging server
# brew "nats-streaming-server"         # NATS persistent streaming server
brew "ncdu"                      # NCurses disk usage analyzer
brew "neovim"                    # Hyperextensible Vim-based text editor
brew "nmap"                      # Network scanner and security auditing tool
brew "nushell"                   # Structured data shell (pipelines return tables)
brew "oh-my-posh"                # Cross-shell prompt theme engine
brew "openjdk"                   # Java Development Kit (open source)
brew "opentofu"                  # Terraform-compatible infrastructure as code
brew "p7zip"                     # 7-Zip file archiver (command-line)
brew "pandoc"                    # Universal document format converter
brew "pipx"                      # Install Python CLI tools in isolated environments
brew "podman-compose"            # Docker Compose alternative for Podman
brew "podman-tui"                # TUI for managing Podman containers
brew "poppler"                   # PDF rendering library (for previews) # yazi dependency
brew "portal"                    # Secure file transfer between computers
brew "portaudio"                 # Cross-platform audio I/O library
brew "pueue"                     # Background task queue manager
brew "pv"                        # Pipe viewer - monitor data through a pipeline
brew "pyenv"                     # Python version management
brew "pygments"                  # Syntax highlighting library (used by other tools)
brew "rainfrog"                  # TUI for PostgreSQL database management
brew "ripgrep"                   # Ultra-fast recursive text search (grep replacement) # yazi dependency
brew "ruff"                      # Extremely fast Python linter and formatter
brew "runpod/runpodctl/runpodctl" # RunPod GPU cloud management CLI
brew "rust"                      # Rust programming language
brew "sevenzip"                  # 7-Zip archiver (modern version) # yazi dependency
brew "sha3sum"                   # SHA-3 hash calculator
brew "skopeo"                    # Container image copy/inspect without daemon
brew "sshs"                      # TUI for SSH config - interactive host selector
brew "starship"                  # Minimal cross-shell prompt (alternative to oh-my-posh)
brew "stow"                      # Symlink farm manager for dotfiles
brew "thefuck"                   # Auto-correct previous console command typos
brew "tlrc"                      # TLDR pages client (community man page summaries)
brew "tmux"                      # Terminal multiplexer (sessions, windows, panes)
brew "topgrade"                  # Unified system updater (brew, npm, pip, etc.)
brew "tree-sitter"               # Incremental parsing library for syntax trees
brew "tree-sitter-cli"           # CLI for developing tree-sitter grammars
brew "trippy"                    # Network diagnostic tool (TUI traceroute)
brew "uv"                        # Extremely fast Python package manager (pip/venv replacement)
brew "worktrunk"                 # CLI for Git worktree management, designed for parallel AI agent workflows
brew "wget"                      # File downloader (HTTP/HTTPS/FTP)
brew "yazi"                      # Blazing fast terminal file manager # yazi dependency
brew "ykman"                     # YubiKey Manager CLI
brew "yq"                        # YAML/JSON/XML processor (like jq for YAML)
brew "zellij"                    # Terminal workspace manager (tmux alternative)
brew "zoxide"                    # Smarter cd - learns your most used directories # yazi dependency
brew "zsh-autosuggestions"       # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting"   # Fish-like syntax highlighting for Zsh
brew "xh"                        # Friendly HTTP client with intuitive syntax (HTTPie alternative)

# Casks
# cask "shottr"                       # Screenshot tool with annotations
# cask "yubico-yubikey-manager"       # YubiKey configuration GUI
# cask "basictex"                     # Minimal TeX distribution (smaller than MacTeX)
cask "amethyst"                  # Tiling window manager for macOS
cask "antigravity"               # Window manager - keep windows on top
cask "arc"                       # Chromium-based browser with workspaces
cask "audacity"                  # Audio editor and recorder
cask "balenaetcher"              # USB/SD card image flasher
cask "bartender"                 # Menu bar icon manager
cask "bitwarden"                 # Open-source password manager
cask "calibre"                   # E-book manager and converter
cask "chatgpt"                   # OpenAI ChatGPT desktop app
cask "claude"                    # Anthropic Claude AI desktop app
cask "claude-code"               # Claude Code CLI tool
cask "cleanshot"                 # Screenshot and screen recording tool
cask "coconutbattery"            # Battery health monitor for Mac/iOS
cask "commander-one"             # Dual-pane file manager
cask "codex"                     # OpenAI Codex CLI agent
cask "codex-app"                 # OpenAI Codex desktop app
cask "cursor"                    # AI-powered code editor (VS Code fork)
cask "cursor-cli"                # Cursor editor CLI
cask "cyberduck"                 # Cloud storage browser (S3, FTP, SFTP)
cask "discord"                   # Voice and text chat platform
cask "disk-diet"                 # Disk space cleanup utility
cask "downie"                    # Video downloader for web videos
cask "drawio"                    # Diagram and flowchart editor
cask "drivedx"                   # Disk health diagnostics (SMART monitoring)
cask "excalidrawz"               # Virtual whiteboard for sketching
cask "figma"                     # Collaborative UI design tool
cask "firefox"                   # Mozilla web browser
cask "folx"                      # Download manager with torrent support
cask "font-meslo-lg-nerd-font"   # Nerd Font for terminal icons
cask "font-symbols-only-nerd-font" # Nerd Font symbols fallback # yazi dependency
cask "ghostty"                   # GPU-accelerated terminal emulator
cask "github"                    # GitHub Desktop client
cask "google-chrome"             # Google web browser
cask "gcloud-cli"                # Google Cloud SDK and CLI
cask "grammarly-desktop"         # Writing assistant and grammar checker
cask "handbrake-app"             # Video transcoder and converter
cask "helium-browser"            # Floating browser window (always on top)
cask "iina"                      # Modern media player for macOS
cask "imageoptim"                # Image compression tool (lossless)
cask "iterm2"                    # Feature-rich terminal emulator
cask "keka"                      # File archiver (zip, 7z, tar, etc.)
cask "keycastr"                  # Keystroke visualizer for screencasts
cask "latest"                    # App update checker for macOS
cask "lm-studio"                 # Local LLM runner with GUI
cask "losslesscut"               # Lossless video/audio trimmer
cask "maccy"                     # Clipboard manager (lightweight)
cask "mactex"                    # Full TeX/LaTeX distribution for macOS
cask "monitorcontrol"            # External monitor brightness/volume control
cask "mullvad-browser"           # Privacy-focused browser (Tor-based)
cask "mullvad-vpn"               # Privacy VPN service client
cask "netbird-ui"                # NetBird mesh VPN GUI
cask "obsidian"                  # Markdown-based knowledge management
cask "ollama-app"                # Local LLM runner (llama, mistral, etc.)
cask "opencode-desktop"          # OpenCode AI coding assistant desktop app
cask "onyx"                      # macOS system maintenance and optimization
cask "pdf-squeezer"              # PDF file size reducer
cask "permute"                   # Media format converter (video/audio/image)
cask "pearcleaner"               # App uninstaller with leftover cleanup
cask "podman-desktop"            # Container management GUI (Docker alternative)
cask "raycast"                   # Productivity launcher (Spotlight replacement)
cask "slack"                     # Team messaging platform
cask "soulver"                   # Smart calculator with natural language
cask "spotify"                   # Music streaming service
cask "sublime-text"              # Fast text editor
cask "telegram-desktop"          # Telegram messaging (native desktop)
cask "telegram"                  # Telegram messaging (macOS native)
cask "tg-pro"                    # Temperature and fan monitoring
## cask "tor-browser"
cask "transmit"                  # FTP/SFTP/S3 file transfer client
cask "upscayl"                   # AI image upscaler (open source)
cask "viber"                     # Messaging and calling app
cask "visual-studio-code"        # Microsoft code editor
cask "voiceink"                  # Speech-to-text transcription
cask "warp"                      # AI-powered terminal emulator
cask "wechat"                    # WeChat messaging app
cask "wezterm"                   # GPU-accelerated terminal with Lua config
cask "whatsapp"                  # WhatsApp messaging desktop client
cask "windsurf"                  # AI-powered code editor (Codeium)
cask "wireshark-app"             # Network protocol analyzer
cask "yubico-authenticator"      # YubiKey TOTP/FIDO authenticator
cask "zed"                       # High-performance code editor (Rust-based)
cask "zen"                       # Privacy-focused Firefox fork browser
cask "zoom"                      # Video conferencing

# Mac App Store apps
## mas "Velja", id: 1607635845           # Browser picker (open links in specific browsers)
# mas "Battery Monitor", id: 413678017   # Battery health and status tracker
# mas "Dropover", id: 1355679052         # Drag-and-drop staging shelf
# mas "Encrypto", id: 935235287          # AES file encryption tool
# mas "Folder Preview", id: 6698876601   # Quick Look for folder contents
# mas "Keynote", id: 409183694           # Apple presentation app
# mas "Meeter", id: 1510445899           # Meeting calendar menu bar app
# mas "Mysterium VPN", id: 6446624307    # Decentralized VPN service
# mas "Numbers", id: 409203825           # Apple spreadsheet app
# mas "PDFgear", id: 6469021132          # PDF reader and editor
# mas "Pages", id: 409201541             # Apple word processor
# mas "Perplexity: Ask Anything", id: 6714467650 # AI search engine
# mas "Pixelmator Pro", id: 1289583905   # Image editor (Photoshop alternative)
# mas "StopTheMadness Pro", id: 6471380298 # Safari extension for web annoyances
# mas "System Monitor", id: 423368786    # System resource usage monitor
# mas "Telegram Lite", id: 946399090     # Lightweight Telegram client
# mas "Xcode", id: 497799835             # Apple IDE for macOS/iOS development
