# How to
# install brew
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew tap homebrew/bundle
# touch ~/brewfile
# Install and update from brew bundle
# brew bundle --file=~/brewfile
# Export for existing install into Bundle
# brew bundle dump --file=~/brewfile --force
# brew bundle cleanup --force --file=~/brewfile
# brew outdated && brew upgrade --greedy --dry-run && mas outdated
# brew bundle --file=~/brewfile --force --verbose ; brew upgrade --greedy
# brew update : brew outdated ; brew upgrade --greedy --dry-run ; mas outdated ; brew bundle --file=~/brewfile --force ; brew upgrade --greedy
# in nushell 
# brew update ; brew outdated ; brew upgrade --greedy --dry-run ; mas outdated  ; try { brew bundle --file=~/brewfile --force } catch { |err| print -e $err }; brew upgrade --greedy ; try { npm outdated -g --depth=0 } catch { |err| print -e $err }; npm update -g

# Taps
tap "adoptopenjdk/openjdk"
tap "sst/tap"
tap "nats-io/nats-tools"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "runpod/runpodctl"

# Brews
# brew "docker-compose"
# brew "kubectl"
brew "age"
brew "asciinema"
brew "asitop"
brew "atac"
brew "atuin"
brew "bat"
brew "btop"
brew "carapace"
brew "cmake"
brew "eza"
brew "fd" # yazi dependancy
brew "fdupes"
brew "ffmpeg" # yazi dependancy
brew "ffmpegthumbnailer" # yazi dependancy
brew "fzf" # yazi dependancy
brew "gh"
brew "helix"
brew "huggingface-cli"
brew "imagemagick" # yazi dependancy
brew "jj"
brew "jq" # yazi dependancy
brew "lf"
brew "lima"
brew "llm"
brew "llvm"
brew "mas"
brew "mlx"
brew "nats-io/nats-tools/nats"
brew "nats-server"
brew "nats-streaming-server"
brew "ncurses"
brew "nmap"
brew "node"
brew "nushell"
brew "oh-my-posh"
brew "openjdk"
brew "openssl"
brew "p7zip"
brew "pandoc"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "poppler" # yazi dependancy
brew "portal"
brew "portaudio"
brew "pueue"
brew "pv"
brew "pyenv"
brew "pygments"
brew "pytorch"
brew "rainfrog"
brew "ripgrep" # yazi dependancy
brew "runpod/runpodctl/runpodctl"
brew "rust"
brew "sevenzip" # yazi dependancy
brew "sqlite"
brew "sshs"
brew "sst/tap/opencode"
brew "starship"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "trippy"
brew "uv"
brew "wget"
brew "yazi" # yazi dependancy
brew "ykman"
brew "yq"
brew "yubikey-personalization"
brew "zellij"
brew "zoxide" # yazi dependancy

# Casks
# cask "shottr"
#cask "basictex"
#cask "mullvad-vpn@beta"
cask "amethyst"
cask "arc"
cask "audacity"
cask "bartender"
cask "bitwarden"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "coconutbattery"
cask "commander-one"
cask "cyberduck"
cask "discord"
cask "disk-diet"
cask "downie"
cask "drawio"
cask "drivedx"
cask "excalidrawz"
cask "figma"
cask "firefox"
cask "folx"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font" # yazi dependancy
cask "ghostty"
cask "github"
cask "google-chrome"
cask "grammarly-desktop"
cask "handbrake-app"
cask "iina"
cask "imageoptim"
cask "keka"
cask "keycastr"
cask "latest"
cask "lm-studio"
cask "maccy"
cask "mactex"
cask "monitorcontrol"
cask "msty"
cask "mullvad-browser"
cask "mullvad-vpn"
cask "netbird-ui"
cask "obsidian"
cask "ollama-app"
cask "onyx"
cask "pdf-squeezer"
cask "permute"
cask "podman-desktop"
cask "raycast"
cask "slack"
cask "soulver"
cask "soulver-cli"
cask "spotify"
cask "sublime-text"
cask "tg-pro"
cask "tor-browser"
cask "transmit"
cask "upscayl"
cask "viber"
cask "visual-studio-code"
cask "voiceink"
cask "warp"
cask "wezterm"
cask "whatsapp"
cask "wireshark-app"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zen"
cask "zoom"

# Mac App Store apps
# mas "Manus AI", id: 6740909540
## mas "Velja", id: 1607635845
mas "Battery Monitor", id: 413678017
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "Folder Preview", id: 6698876601 
mas "HotKey", id: 975890633
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Mysterium VPN", id: 6446624307
mas "Numbers", id: 409203825
mas "PDFgear", id: 6469021132
mas "Pages", id: 409201541
mas "Perplexity: Ask Anything", id: 6714467650
mas "Pixelmator Pro", id: 1289583905
mas "StopTheMadness Pro", id: 6471380298
mas "System Monitor", id: 423368786
mas "Telegram Lite", id: 946399090
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
