# How to
# install brew
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew tap homebrew/bundle
# touch ~/brewfile
# Install and update from brew bundle
# brew bundle --file=~/brewfile
# Export for existing install into Bundle
# brew bundle dump --file=~/brewfile --force
# brew bundle cleanup --force --file=~/brewfile
# brew outdated && brew upgrade --greedy --dry-run && mas outdated
# brew bundle --file=~/brewfile --force --verbose ; brew upgrade --greedy
# brew update : brew outdated ; brew upgrade --greedy --dry-run ; mas outdated ; brew bundle --file=~/brewfile --force ; brew upgrade --greedy
# in nushell
# brew update ; brew outdated ; brew upgrade --greedy --dry-run ; mas outdated  ; try { brew bundle --file=~/brewfile --force } catch { |err| print -e $err }; brew upgrade --greedy ; try { npm outdated -g --depth=0 } catch { |err| print -e $err }; npm update -g
# invlugin pip and uv
# brew update ; brew outdated ; brew upgrade --greedy --dry-run ; mas outdated  ; try { brew bundle --file=~/brewfile --force } catch { |err| print -e $err }; brew upgrade --greedy --force ; npm ls -g ; try { npm outdated -g --depth=0 } catch { |err| print -e $err }; npm update -g ; uv pip list ; uv pip list ; uv pip list --outdated ; uv tool list ; uv tool upgrade --all --no-cache
# install mapackage manually >  brew install --cask cursor-cli
# remove package mannually > brew uninstall --cask cursor-cli
# reinstal package manually > brew reinstall --cask cursor-cli

# Taps
tap "adoptopenjdk/openjdk"
tap "sst/tap"
tap "nats-io/nats-tools"
tap "netbirdio/tap"
tap "nikitabobko/tap"
tap "runpod/runpodctl"
tap "oven-sh/bun"


# Brews
# brew "docker-compose"
# brew "kubectl"
brew "age"
brew "asciinema"
brew "asdf"
brew "asitop"
brew "atac"
brew "atuin"
brew "awscli"
brew "bat"
brew "oven-sh/bun/bun"
brew "btop"
brew "carapace"
brew "code2prompt"
brew "cmake"
brew "crane"
brew "czkawka"
brew "dust"
brew "elixir-ls"
brew "exiftool"
brew "eza"
brew "fd" # yazi dependancy
brew "fdupes"
brew "ffmpegthumbnailer" # yazi dependancy
brew "fzf" # yazi dependancy
brew "go"
brew "gh"
brew "glow" # markdown cli document viewer
brew "helix"
brew "huggingface-cli"
brew "imagemagick" # yazi dependancy
brew "jj"
brew "jq" # yazi dependancy
brew "kimi-cli"
brew "llama.cpp"
brew "lf"
brew "lima"
brew "llm"
brew "lua-language-server"
brew "mas"
# brew "nats-io/nats-tools/nats"
# brew "nats-server"
# brew "nats-streaming-server"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "nushell"
brew "oh-my-posh"
brew "openjdk"
brew "opentofu"
brew "p7zip"
brew "pandoc"
brew "pipx"
brew "podman-compose"
brew "podman-tui"
brew "poppler" # yazi dependancy
brew "portal"
brew "portaudio"
brew "pueue"
brew "pv"
brew "pyenv"
brew "pygments"
brew "rainfrog"
brew "ripgrep" # yazi dependancy
brew "ruff"
brew "runpod/runpodctl/runpodctl"
brew "rust"
brew "sevenzip" # yazi dependancy
brew "sha3sum"
brew "skopeo"
brew "sshs"
brew "starship"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "topgrade"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "trippy"
brew "uv"
brew "wget"
brew "yazi" # yazi dependancy
brew "ykman"
brew "yq"
brew "zellij"
brew "zoxide" # yazi dependancy
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
# cask "shottr"
# cask "yubico-yubikey-manager"
# cask "basictex"
cask "amethyst"
cask "antigravity"
cask "arc"
cask "audacity"
cask "balenaetcher"
cask "bartender"
cask "bitwarden"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "coconutbattery"
cask "commander-one"
cask "cursor"
cask "cursor-cli"
cask "cyberduck"
cask "discord"
cask "disk-diet"
cask "downie"
cask "drawio"
cask "drivedx"
cask "excalidrawz"
cask "figma"
cask "firefox"
cask "folx"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font" # yazi dependancy
cask "ghostty"
cask "github"
cask "google-chrome"
cask "gcloud-cli"
cask "grammarly-desktop"
cask "handbrake-app"
cask "helium-browser"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "keycastr"
cask "latest"
cask "lm-studio"
cask "losslesscut"
cask "maccy"
cask "mactex"
cask "monitorcontrol"
cask "mullvad-browser"
cask "mullvad-vpn"
cask "netbird-ui"
cask "obsidian"
cask "ollama-app"
cask "onyx"
cask "pdf-squeezer"
cask "permute"
cask "pearcleaner"
cask "podman-desktop"
cask "raycast"
cask "slack"
cask "soulver"
cask "spotify"
cask "sublime-text"
cask "telegram-desktop"
cask "telegram"
cask "tg-pro"
cask "tor-browser"
cask "transmit"
cask "upscayl"
cask "viber"
cask "visual-studio-code"
cask "voiceink"
cask "warp"
cask "wechat"
cask "wezterm"
cask "whatsapp"
cask "wireshark-app"
cask "yubico-authenticator"
cask "zed"
cask "zen"
cask "zoom"

# Mac App Store apps
## mas "Velja", id: 1607635845
# mas "Battery Monitor", id: 413678017
# mas "Dropover", id: 1355679052
# mas "Encrypto", id: 935235287
# mas "Folder Preview", id: 6698876601
# mas "Keynote", id: 409183694
# mas "Meeter", id: 1510445899
# mas "Mysterium VPN", id: 6446624307
# mas "Numbers", id: 409203825
# mas "PDFgear", id: 6469021132
# mas "Pages", id: 409201541
# mas "Perplexity: Ask Anything", id: 6714467650
# mas "Pixelmator Pro", id: 1289583905
# mas "StopTheMadness Pro", id: 6471380298
# mas "System Monitor", id: 423368786
# mas "Telegram Lite", id: 946399090
# mas "Xcode", id: 497799835
